src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	//TODO: Вставить содержимое обработчика
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ОтображениеЭлементовФормы()
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ОтображениеЭлементовФормы()
		
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ОтображениеЭлементовФормы()
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	
	
КонецПроцедуры
